/*********************************************************************************************
//                     GM SerialDebug串口调试软件 by 李锦上&#xA;
// * 功能简介 &#xA;
// * =======================================&#xA;
// * 1.串口基本功能 &#xA;
// * 支持文本模式、HEX模式发送和接收； &#xA;
// * 支持自动搜索可用串口； &#xA;
// * 串口打开时可设置波特率； &#xA;
// * 支持自动发送； &#xA;
// * 支持保存接收数据、打开发送数据； &#xA;
// * 支持HEX模式发送时自动格式化输入数据：自动去除多余的空格、自动拆分少输入的空格、自动补0；&#xA;
// * 例如输入：A0 b  c D0E  &#xA;
// * 格式化后：A0 0B 0C D0 0E &#xA;
// * 选择：暂停接收后可选择接收区数据，否则不能选择 &#xA;
// * 自动发送：发送周期小于10ms按10ms处理 &#xA;
// * 智能滚动：鼠标在接受区内不自动滚动到底部，否则收到新数据自动滚动至底部方便观察 &#xA;
// * 分割帧：在HEX模式接收时自动尝试分割帧 &#xA;&#xA;
// * =======================================&#xA;
// * 2.数据示波功能：当连接的串口收到指定格式的数据时会将数据转成波形显示在数据示波窗口。&#xA;
// * 通信协议：支持CH0-CH9十个通道。&#xA;
// * 帧格式例：A5 5A 0B A0 A4 70 45 41 A4 70 45 C1 AA  &#xA;
// * Byte0-1 ：A5 5A 帧头 &#xA;
// * Byte2   ：0B 本帧包含的字节数，除了起始字节外 &#xA;
// * Byte3   ：A0 功能码 数据示波 &#xA;
// * Byte4-7 ：A4 70 45 41 (float) CH0通道的数据:12.34 &#xA;
// * Byte8-11：A4 70 45 C1 (float) CH1通道的数据:-12.34 &#xA;
// * Byte12  ：AA 帧尾 &#xA;
// * 点击右侧CH0-CH9通道按钮，可隐藏或显示曲线。隐藏曲线后只显示通道号，显示曲线时会显示当前通道的数据 &#xA;
// * 每屏点数：每屏固定显示点数，超过此值如在自动滚屏状态会自动滚屏；在鼠标拖拽查看时此项无效 &#xA;
// * 自动滚屏：自动跟踪最新数据并向左滚动屏幕 &#xA;
// * 暂停：暂停接收帧数据并停止更新屏幕 &#xA;
// * 保存图像：将屏幕的数据保存成PNG图片格式 &#xA;
// * 保存数据：将收到的波形数据保存成.CSV格式以便用Excel分析 &#xA;
// * 缩放：鼠标放在图表区滚动滚轮可缩放x轴；按住Ctrl+滚轮可同步缩放x轴和y轴；按住Ctrl+鼠标拖动可选区放大 &#xA;
// * 自测试：可以自动生成CH0-CH9十通道正弦数据供测试用 &#xA; &#xA;
// * =======================================&#xA;
// * 3.参数调试功能：当勾选启用参数调试时，串口发送部分由参数调试窗口接管，此时串口发送区内容无效。&#xA;
// * LED通信协议：&#xA;
// * 帧格式例：A5 5A 0B B0 01 00 FF 00 00 00 00 00 AA &#xA;
// * Byte0-1 ：A5 5A 帧头 &#xA;
// * Byte2   ：0B 本帧包含的字节数，除了起始字节外 &#xA;
// * Byte3   ：B0 功能码 LED状态 &#xA;
// * Byte4   ：01 LED0的状态:非0点亮 &#xA;
// * Byte5   ：00 LED1的状态:为0熄灭 &#xA;
// * Byte6   ：FF LED2的状态:非0点亮 &#xA;
// * Byte7   ：00 LED3的状态:为0熄灭 &#xA;
// * Byte8   ：00 LED4的状态:为0熄灭 &#xA;
// * Byte9   ：00 LED5的状态:为0熄灭 &#xA;
// * Byte10  ：00 LED6的状态:为0熄灭 &#xA;
// * Byte11  ：00 LED7的状态:为0熄灭 &#xA;
// * Byte12  ：AA 帧尾 &#xA; &#xA;
// * 滑块通信协议：&#xA;
// * 帧格式例：A5 5A 23 C0 A4 70 45 41 B8 1E 63 42     &#xA;
// *           00 00 00 00 00 00 00 00 00 00 00 00     &#xA;
// *           00 00 00 00 00 00 00 00 00 00 00 00 AA  &#xA;
// * Byte0-1 ：A5 5A 帧头 &#xA;
// * Byte2   ：23 本帧包含的字节数，除了起始字节外 &#xA;
// * Byte3   ：C0 功能码 参数调试-滑块 &#xA;
// * Byte4-7 ：A4 70 45 41 (float) 滑块0的数据:12.34 &#xA;
// * Byte8-11：B8 1E 63 42 (float) 滑块1的数据:56.78 &#xA;
// * Byte12-35：滑块2-滑块7的数据 &#xA;
// * Byte36  ：AA 帧尾 &#xA; &#xA;
// * 按钮通信协议：&#xA;
// * 帧格式例：A5 5A 05 D0 00 01 AA  &#xA;
// * Byte0-1 ：A5 5A 帧头 &#xA;
// * Byte2   ：05 本帧包含的字节数，除了起始字节外 &#xA;
// * Byte3   ：D0 功能码 参数调试-按钮 &#xA;
// * Byte4   ：00 按钮数据高字节:备用 &#xA;
// * Byte5   ：01 按钮数据低字节:按钮0按下 (0x80:按钮7按下) &#xA;
// * Byte6   ：AA 帧尾 &#xA; &#xA;
// * 保存配置：保存界面设置 &#xA; &#xA;
// * =======================================&#xA;
// * 软件更新地址：http://pan.baidu.com/s/1kVF8OdD &#xA;
// * 本人读书读的少，加之时间匆忙，难免有bug，还请谅解，如您发现bug,还请不吝指正 &#xA;
// * E-mail:lijinshang@126.com &#xA;
**********************************************************************************************/
#ifndef	__SERIAL_DEBUG_H
#define	__SERIAL_DEBUG_H

#define SIN_WAVE		0		//正弦波
#define SELF_DEBUG		1		//自我调试
#define NORMAL			2		//正常使用


extern float Parameter[8];		//滑块0-7 滑块值会更新到这里

void SerialDebug_SetChannelData(unsigned char Channel, float Data);

unsigned char SerialDebug_Generate(unsigned char Channel_Number);

void SerialDebug_DataWaveform(void);

void SerialDebug_ParameterDebug_LED(void);

void SerialDebug_ParameterDebug(void);


#endif

